// Дан одномерный целочисленный массив А[n], заданный случайными числами на промежутке [-10; 10].
// Переписать во второй массив B только нечетные элементы массива А. Выполните циклический сдвиг элементов с
// последней позиции нового массива влево на одну позицию. Переписать обратно (заменить) в исходный массив все нечетные элементы со смещением.
#include <windows.h>
#include <iostream>
using namespace std;

int main() {
    SetConsoleOutputCP(CP_UTF8);
    srand(time(0));
    int n;
    cout << "Введите размер массива: ";
    cin >> n;

    int a[n], b[n];

    for (int i = 0; i < n; i++) {
        a[i] = rand() % 21 - 10;
    }

    cout << "Сгенерированный массив: ";
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    cout << endl;
    for (int i = 1; i < n; i += 2) {
        b[i] = a[i];
        cout << a[i] << "\t" << b[i] << endl;
    }
}
