#include <iostream>  // подключаем библиотеку для работы с вводом/выводом (cin, cout)
using namespace std; // использования стандартного пространства имён что бы не писать всё время std::cout, std::cin and std::endl

int main()
{
    double R, C;                                     // объявляем два вещественых числа с двойной точностью
                                                     // R — радиус, C — длина окружности
    cout << "Enter your R, please" << endl;          // выводим сообщение, просим ввести радиус
    cin >> R;                                        // читаем число от пользователя и записываем в R
    double pi = 3.141592653589793;                   // создаём числа Пи
    C = 2 * pi * R;                                  // формула длины окружности (C = 2πR)
    cout << "C(circumference length)=" << C << endl; // выводим результата расчёта

    system("PAUSE"); // задержка программы, чтобы окно консоли не закрылось сразу

    return 0; // возвращаем 0 о том что программа закончила работу.
}
