#include <iostream>  // подключаем библиотеку для работы с вводом/выводом (cin, cout)
using namespace std; // использования стандартного пространства имён что бы не писать всё время std::cout, std::cin and std::endl

int main()
{
    float x, y, z, q;                         // объявляем четыре вещественных числа (x, y, z, q)
    cout << "Enter your x, please: " << endl; // запрашиваем у пользователя значение x
    cin >> x;                                 // читаем число от пользователя и записываем в x
    cout << "Enter your y, please: " << endl; // запрашиваем у пользователя значение y
    cin >> y;                                 // читаем число от пользователя и записываем в y
    cout << "Enter your z, please: " << endl; // запрашиваем у пользователя значение z
    cin >> z;                                 // читаем число от пользователя и записываем в z
    cout << "Enter your q, please: " << endl; // запрашиваем у пользователя значение q
    cin >> q;                                 // читаем число от пользователя и записываем в q

    // создаём временную переменную temp, чтобы сохранить старое значение x
    float temp = x;

    // выполняем перестановку значений по условию задачи:
    x = y;    // x получает старое значение y
    y = z;    // y получает старое значение z
    z = q;    // z получает старое значение q
    q = temp; // q получает старое значение x (из temp)

    cout << "x = " << x << endl; // выводим новое значение для x
    cout << "y = " << y << endl; // выводим новое значение для y
    cout << "z = " << z << endl; // выводим новое значение для z
    cout << "q = " << q << endl; // выводим новое значение для q

    system("PAUSE"); // задержка программы, чтобы окно консоли не закрылось сразу

    return 0; // возвращаем 0 о том что программа закончила работу.
}
