#include <iostream>  // подключаем библиотеку для работы с вводом/выводом (cin, cout)
#include <cmath>     // подключаем библиотеку для работы с математических функций (cbrt, floor, ceil)
using namespace std; // использования стандартного пространства имён что бы не писать всё время std::cout, std::cin and std::endl

int main()
{
    float x, y, z; // объявляем три вещественных числа для ввода
    int q;         // переменная для хранения суммы с без дробной части

    cout << "Enter your x, please: " << endl; // запрашиваем у пользователя значение x
    cin >> x;                                 // читаем число от пользователя и записываем в x
    cout << "Enter your y, please: " << endl; // запрашиваем у пользователя значение y
    cin >> y;                                 // читаем число от пользователя и записываем в y
    cout << "Enter your z, please: " << endl; // запрашиваем у пользователя значение z
    cin >> z;                                 // читаем число от пользователя и записываем в z

    q = x + y + z;                       // считаем сумму x+y+z
    cout << "Ceil x+y+z: " << q << endl; // выводим целую часть суммы

    // вычисляем среднее геометрическое трех чисел
    double g, f;
    g = cbrt(x * y * z); // кубический корень произведения x*y*z

    // находим дробную часть среднего геометрического
    double frac = g - floor(g);                   // дробная часть = число - целая часть
    cout << "fractional part = " << frac << endl; // выводим дробную часть

    system("PAUSE"); // задержка программы, чтобы окно консоли не закрылось сразу

    return 0; // возвращаем 0 о том что программа закончила работу.
}
