#include <iostream>  // подключаем библиотеку для работы с вводом/выводом (cin, cout)
#include <cmath>     // подключаем библиотеку для работы с математических функций (cbrt, floor, ceil)
using namespace std; // использования стандартного пространства имён что бы не писать всё время std::cout, std::cin and std::endl

int main()
{
    double z1, z2; // переменные для хранения результатов вычислений
    float a;       // вводимое пользователем число

    cout << "Enter your a, please: " << endl; // запрашиваем у пользователя значение a
    cin >> a;                                 // читаем число от пользователя и записываем в a

    double pi = 3.141592653589793; // создаём числа Пи

    z1 = pow(cos(3 / 8 * pi - a / 4), 2) - pow(cos(11 / 8 * pi + a / 4), 2); // вычисляем z1 по формуле

    z2 = (sqrt(2) / 2) * sin(a / 2); // вычисляем z2 по формуле

    cout << z1 << endl; // выводим результат z1
    cout << z2 << endl; // выводим результат z2

    system("PAUSE"); // задержка программы, чтобы окно консоли не закрылось сразу

    return 0; // возвращаем 0 о том что программа закончила работу.
}
