#include <iostream>  // подключаем библиотеку для работы с вводом/выводом (cin, cout)
#include <cmath>     // подключаем библиотеку для работы с математических функций (cbrt, floor, ceil)
using namespace std; // использования стандартного пространства имён что бы не писать всё время std::cout, std::cin and std::endl

int main()
{
    char a = 'A';                              // латинская A
    char b = 'B';                              // латинская B
    cout << "Сумма A+B = " << int(a) + int(b); // при приведении типа char к int получаем их ASCII-коды: 'A' = 65, 'B' = 66.
    system("PAUSE");                           // задержка программы, чтобы окно консоли не закрылось сразу

    return 0; // возвращаем 0 о том что программа закончила работу.
}